customEmoji = [[":chinko:","<:chinko:1134001412695674891>"],
               [":ognk:","<:ognk:1133854076182986793>"],
               [":deka:","<:deka:1134020757983330304>"],
               [":ero:","<:ero:1133855884540383333>"],
               [":siko:","<:siko:1134017068145057892>"],
               [":kansya:","<:kansya:1134217544937508955>"],
               [":baba:","<:baba:1134513176210317382>"],
               [":is:","<:is:1134512504844849162>"],
               [":you:","<:you:1134512789340291142>"],
               [":a_:","<:a_:1134523410584698900>"],
               [":e_:","<:e_:1134422095330279444>"],
               [":n_:","<:n_:1135530206661197984>"],
               [":owari:","<:owari:1136232461542633504>"],
               [":ya:","<:ya:1146678901221892107>"],
               [":sei:","<:sei:1133968046915076116>"],
               [":si:","<:si:1133966404001996881>"],
               [":sou:","<:sou:1133969434793492510>"],
               [":utsu:","<:utsu:1133951952754057246>"],
               [":ii:","<:ii:1134043430289416243>"],
               [":kusa:","<:kusa:1134039196391182448>"],
               [":ikunai:","<:ikunai:1134046737338732624>"],
               [":ognk_yoko:","<:ognk_yoko:1134506538325778593>"],
               [":vs:","<:vs:1134518937074274385>"],
               [":win:","<:win:1135077422824427562>"],
               [":question:","<:question_mark:1149724448405065809>"],
               [":aji:","<:aji:1133981540842479629>"],
               [":wara:","<:wara:1133856183443259432>"],
               [":shingi:","<:shingi:1135535797785874453>"],
               [":retweet:","<:retweet:1150065394699223101>"],
               [":suman:","<:suman:1134611029003862169>"],
               [":seven_sp:","<:seven_sp:1150817444894617640>"],
               [":msto:","<:msto:1149730665076637776>"],
               [":gosen:","<:gosen:1152534375448199239>"],
               [":tyoen:","<:tyoen:1152534407140343818>"],
               [":hoshii:","<:hoshii:1152179242617020447>"],
               [":ognk_l:","<:ognk_l:1161359198408429650>"],
               [":ognk_r:","<:ognk_r:1161359236375261214>"],
               [":dice_1:","<:dice_1:1278521756176613428>"],
               [":dice_2:","<:dice_2:1278521805279330394>"],
               [":dice_3:","<:dice_3:1278521883142389880>"],
               [":dice_4:","<:dice_4:1278521923139145818>"],
               [":dice_5:","<:dice_5:1278521957935218708>"],
               [":dice_6:","<:dice_6:1278521991791640639>"]]

def convCustomEmoji(str):
    for i in range(len(customEmoji)):
        str = str.replace(customEmoji[i][0],customEmoji[i][1])

    return str

help_docs = [ ["call",
              "## ―― !!call\n"
              "真鯖botが鳴きます"
              ],
              ["dice",
              "## ―― !!dice\n"
              "`!!dice (個数)d(最大値)`で、出目が1～`(最大値)`のサイコロを`(個数)`個振ったときの合計が出ます\n"
              "単に`!!dice`と送信した場合は2d6(6面ダイス2個)が振られます"
              ],
              ["rand",
              "## ―― !!rand\n"
              "`!!rand (最小値) (最大値)`で、`(最小値)`～`(最大値)`の整数の乱数が1つ出ます"
              ],
              ["coin",
              "## ―― !!coin\n"
              "コイントスができます　表は<:sei:1133968046915076116>、裏は<:si:1133966404001996881>"
              ],
              ["shout",
              "## ―― !!shout\n"
              "○に文字を入れて言葉を作れ！スプリントシャウトが出題されます\n"
              "完全にランダムなのでたまに答えが存在しないときがあります\n"
              "`!!shout hard`でハードモードに挑戦できます"
              ],
              ["sniper",
              "## ―― !!sniper\n"
              "お題に合う言葉を素早く見つけろ！ワードスプリントが出題されます\n"
              "完全にランダムなのでたまに答えが存在しないときがあります\n"
              "最後に描かれているpt(ポイント)が高いほど、答えるのが難しいです(だいたい元ネタのボドゲ準拠になっています)"
              ],
              ["login",
              "## ―― !!login\n"
              "ログインボーナスが貰えます　1日1回"
              ],
              ["memory",
              "## ―― !!memory\n"
              "`!!memory (覚えさせたいことば)`で、真鯖botがことばを覚えます\n"
              "覚えた言葉は後に使うかもしれません"
              ],
              ["sv",
              "## ―― !!sv\n"
               "サーバー内架空通貨「Savar<:savar:1218331362415870032>」についての操作を行えます\n"
               "\n"
               "- **!!sv show**\n"
               "自分の所持しているSavarを確認できます\n"
               "また、`!!sv show @(ユーザーのメンション)`で、メンションしたユーザーの所持Savarを確認できます\n"
               "- **!!sv give**\n"
               "`!!sv give @(送り先のメンション) (金額)`で、自分の所持しているSavarを他人に譲渡できます\n"
              ],
              ["bomb",
              "## ―― !!bomb\n"
              "「n個ボタンある爆弾解除ゲーム」についての操作を行えます\n"
              "\n"
              "- **!!bomb newgame**\n"
              "新しくゲームを始められます\n"
              "爆弾が爆破したときや、解除に成功したときなどに\n"
              "- **!!bomb (ボタンの番号)**\n"
              "指定した番号のボタンを押せます"
              ],
              ["dojo",
              "## ―― !!dojo\n"
              "「チンチロ道場」をプレイします\n"
              "(ルール詳細: https://discord.com/channels/1133831716507754536/1151469421605437490/1289674613214941226 )"
              ],
              ["work",
              "## ―― !!work\n"
              "債務者限定のコマンドです\n"
              "入力すると計算問題が出題されるので、45秒以内にその答えを半角数字のみ(他には何も入力しない)で送信し、\n"
              "合っていれば負債を少額返済できます"
              ]
]

def helpDocument(str):
    notFound = True
    for i in range(len(help_docs)):
        if str == help_docs[i][0]:
            notFound = False
            return help_docs[i][1]
    
    if notFound:
        return "NF"